fat23cat/cardputer-hub/src/hardware/esp32/bluetooth/esp32_bluetooth_adapter.cpp
#include "hardware/esp32/bluetooth/esp32_bluetooth_adapter.h"
#include "connectivity/companion/companion_framer.h"
#include "connectivity/companion/companion_protocol.h"
#include "hardware/esp32/bluetooth/ble_peer_event_order.h"

#include <algorithm>
#include <array>
#include <cstddef>
#include <cstdint>
#include <cstring>
#include <string>

#include <esp_bt.h>
#include <esp_log.h>
#include <esp_random.h>
#include <freertos/FreeRTOS.h>
#include <freertos/semphr.h>
#include <freertos/task.h>
#include <host/ble_att.h>
#include <host/ble_gap.h>
#include <host/ble_gatt.h>
#include <host/ble_hs.h>
#include <host/ble_hs_adv.h>
#include <host/ble_sm.h>
#include <host/ble_store.h>
#include <host/util/util.h>
#include <mbedtls/md.h>
#include <nimble/ble.h>
#include <nimble/nimble_npl.h>
#include <nimble/nimble_port.h>
#include <nvs.h>
#include <nvs_flash.h>
#include <os/os_mbuf.h>
#include <services/gap/ble_svc_gap.h>
#include <services/gatt/ble_svc_gatt.h>
#include <store/config/ble_store_config.h>

extern "C" void ble_store_config_init(void);

namespace cardputer_hub::hardware {
namespace {

using bluetooth_detail::PeerEventDisposition;
using bluetooth_detail::PeerEventKind;

struct HostNotifyRequest {
    std::uint16_t connectionHandle = 0;
    std::uint16_t attributeHandle = 0;
    os_mbuf* payload = nullptr;
    int result = BLE_HS_EAGAIN;
    bool inFlight = false;
};

#if defined(CORE_DEBUG_LEVEL)
constexpr int configuredFrameworkDebugLevel = CORE_DEBUG_LEVEL;
#else
constexpr int configuredFrameworkDebugLevel = 4;
#endif
static_assert(configuredFrameworkDebugLevel < 4,
              "ESP32 framework debug logging can expose Bluetooth peer identity");

#if defined(ESP_PLATFORM) && (!CONFIG_BT_NIMBLE_ENABLED || CONFIG_BT_BLUEDROID_ENABLED)
#error "Esp32BluetoothAdapter requires ESP-NimBLE with Bluedroid disabled"
#endif
#if defined(ESP_PLATFORM) && (CONFIG_BT_NIMBLE_ROLE_CENTRAL || CONFIG_BT_NIMBLE_ROLE_OBSERVER)
#error "Esp32BluetoothAdapter must not enable central or observer roles"
#endif
#if defined(ESP_PLATFORM) &&                                                                       \
    (!CONFIG_BT_NIMBLE_ROLE_PERIPHERAL || !CONFIG_BT_NIMBLE_ROLE_BROADCASTER)
#error "Esp32BluetoothAdapter requires peripheral and broadcaster roles"
#endif
#if defined(ESP_PLATFORM) && CONFIG_BT_NIMBLE_MAX_CONNECTIONS != 1
#error "Esp32BluetoothAdapter supports exactly one controller connection"
#endif
#if defined(ESP_PLATFORM) &&                                                                       \
    (!CONFIG_BT_NIMBLE_SECURITY_ENABLE || CONFIG_BT_NIMBLE_SM_LEGACY || !CONFIG_BT_NIMBLE_SM_SC || \
     CONFIG_BT_NIMBLE_SM_SC_DEBUG_KEYS || !CONFIG_BT_NIMBLE_LL_CFG_FEAT_LE_ENCRYPTION ||           \
     CONFIG_BT_NIMBLE_SM_LVL != 3 || CONFIG_BT_NIMBLE_SM_SC_ONLY != 1 ||                           \
     CONFIG_BT_NIMBLE_MAX_BONDS != 16 || !CONFIG_BT_NIMBLE_NVS_PERSIST)
#error "Esp32BluetoothAdapter requires authenticated persistent LE Secure Connections"
#endif

constexpr std::size_t eventQueueCapacity = 16;
constexpr std::size_t peerCapacity = 1;
constexpr std::size_t bondCapacity = 16;
constexpr std::size_t maximumBluetoothDeviceNameLength = 248;
constexpr std::size_t maximumLegacyAdvertisingNameLength = 18;
constexpr std::size_t referenceKeySize = 32;
constexpr const char* configurationPartition = "hub_config";
constexpr const char* bluetoothMetadataNamespace = "bluetooth";
constexpr const char* referenceKeyName = "bond_ref_key";
constexpr TickType_t hostStopTimeout = pdMS_TO_TICKS(5'000);
constexpr std::uint16_t invalidConnectionHandle = BLE_HS_CONN_HANDLE_NONE;
constexpr std::uint16_t hidServiceUuidValue = 0x1812;
constexpr std::uint16_t hidInformationUuidValue = 0x2A4A;
constexpr std::uint16_t hidReportMapUuidValue = 0x2A4B;
constexpr std::uint16_t hidControlPointUuidValue = 0x2A4C;
constexpr std::uint16_t hidReportUuidValue = 0x2A4D;
constexpr std::uint16_t hidProtocolModeUuidValue = 0x2A4E;
constexpr std::uint16_t hidReportReferenceUuidValue = 0x2908;
constexpr std::uint16_t keyboardAppearance = 0x03C1;
constexpr std::uint8_t keyboardReportId = connectivity::keyboardHidReportId;
constexpr std::uint8_t consumerReportId = connectivity::consumerHidReportId;
const auto& hidReportMap = connectivity::hidReportDescriptor;

enum class RawEventType : std::uint8_t {
    HostSynchronized,
    HostFailed,
    AdvertisingStarted,
    AdvertisingCompleted,
    PeerConnected,
    PeerDisconnected,
    PeerIdentityResolved,
    SecurityChallenge,
    SecurityCompleted,
    HidReadinessChanged,
};

struct RawEvent {
    RawEventType type = RawEventType::HostFailed;
    std::uint32_t lifecycle = 0;
    int status = 0;
    std::uint16_t connectionHandle = invalidConnectionHandle;
    ble_addr_t identityAddress{};
    std::uint8_t securityAction = BLE_SM_IOACT_NONE;
    std::uint32_t securityValue = 0;
    connectivity::BluetoothSecurityProperties security{};
    bool keyboardSubscribed = false;
    bool consumerSubscribed = false;
    bool reportProtocol = false;
    bool companionSubscribed = false;
};

struct PeerRecord {
    bool used = false;
    connectivity::BluetoothPeerHandle handle{};
    std::uint16_t connectionHandle = invalidConnectionHandle;
    ble_addr_t identityAddress{};
};

struct AdapterContext {
    Esp32BluetoothAdapter* owner = nullptr;
    portMUX_TYPE mutex = portMUX_INITIALIZER_UNLOCKED;
    std::array<RawEvent, eventQueueCapacity> events{};
    std::size_t eventHead = 0;
    std::size_t eventTail = 0;
    std::size_t eventCount = 0;
    bool queueOverflow = false;
    bool controllerInitialized = false;
    bool controllerEnabled = false;
    bool hostInitialized = false;
    bool hostRunning = false;
    bool hostStartupComplete = false;
    bool stackOwned = false;
    bool synchronized = false;
    bool advertisingRequested = false;
    bool advertisingActive = false;
    bool advertisingStopRequested = false;
    bluetooth_detail::BlePeerEventOrder peerEventOrder;
    std::uint8_t ownAddressType = BLE_OWN_ADDR_PUBLIC;
    std::uint32_t lifecycle = 0;
    std::uint32_t nextPeerHandle = 1;
    std::string deviceName;
    std::optional<connectivity::BluetoothBondReference> advertisingTarget;
    std::array<PeerRecord, peerCapacity> peers{};
    std::array<std::uint8_t, referenceKeySize> referenceKey{};
    bool referenceKeyLoaded = false;
    bool hidServiceRegistered = false;
    bool companionServiceRegistered = false;
    std::uint16_t keyboardInputHandle = 0;
    std::uint16_t keyboardOutputHandle = 0;
    std::uint16_t consumerInputHandle = 0;
    std::uint16_t companionNotifyHandle = 0;
    bool keyboardSubscribed = false;
    bool consumerSubscribed = false;
    bool companionSubscribed = false;
    connectivity::BluetoothSecurityProperties hidSecurity{};
    std::uint8_t hidProtocolMode = 1;
    std::uint8_t hidControlPoint = 1;
    std::array<connectivity::CompanionChunk, 16> companionIncoming{};
    std::size_t companionIncomingHead = 0;
    std::size_t companionIncomingTail = 0;
    std::size_t companionIncomingCount = 0;
    bool companionIncomingOverflow = false;
    StaticSemaphore_t hostStoppedStorage{};
    SemaphoreHandle_t hostStopped = nullptr;
    StaticSemaphore_t notifyDoneStorage{};
    SemaphoreHandle_t notifyDone = nullptr;
    TaskHandle_t hostTaskHandle = nullptr;
    HostNotifyRequest notifyRequest{};
    ble_npl_event notifyEvent{};
};

