fat23cat/cardputer-hub/src/hardware/esp32/bluetooth/esp32_bluetooth_adapter.cpp
AdapterContext context;

const ble_uuid16_t hidServiceUuid = BLE_UUID16_INIT(hidServiceUuidValue);
const ble_uuid16_t hidInformationUuid = BLE_UUID16_INIT(hidInformationUuidValue);
const ble_uuid16_t hidReportMapUuid = BLE_UUID16_INIT(hidReportMapUuidValue);
const ble_uuid16_t hidControlPointUuid = BLE_UUID16_INIT(hidControlPointUuidValue);
const ble_uuid16_t hidReportUuid = BLE_UUID16_INIT(hidReportUuidValue);
const ble_uuid16_t hidProtocolModeUuid = BLE_UUID16_INIT(hidProtocolModeUuidValue);
const ble_uuid16_t hidReportReferenceUuid = BLE_UUID16_INIT(hidReportReferenceUuidValue);

constexpr std::array<std::uint8_t, 4> hidInformation{0x11, 0x01, 0x00, 0x02};
constexpr std::array<std::uint8_t, 2> keyboardInputReference{keyboardReportId, 0x01};
constexpr std::array<std::uint8_t, 2> keyboardOutputReference{keyboardReportId, 0x02};
constexpr std::array<std::uint8_t, 2> consumerInputReference{consumerReportId, 0x01};
std::uint8_t hidInformationTag = 0;
std::uint8_t hidReportMapTag = 0;
std::uint8_t hidProtocolModeTag = 0;
std::uint8_t hidControlPointTag = 0;
std::uint8_t keyboardInputTag = 0;
std::uint8_t keyboardOutputTag = 0;
std::uint8_t consumerInputTag = 0;
std::array<ble_gatt_dsc_def, 2> keyboardInputDescriptors{};
std::array<ble_gatt_dsc_def, 2> keyboardOutputDescriptors{};
std::array<ble_gatt_dsc_def, 2> consumerInputDescriptors{};
std::array<ble_gatt_chr_def, 8> hidCharacteristics{};
std::array<ble_gatt_svc_def, 2> hidServices{};
std::uint8_t companionHostToDeviceTag = 0;
std::uint8_t companionDeviceToHostTag = 0;
ble_uuid128_t companionServiceUuid{};
ble_uuid128_t companionHostToDeviceUuid{};
ble_uuid128_t companionDeviceToHostUuid{};
std::array<ble_gatt_chr_def, 3> companionCharacteristics{};
std::array<ble_gatt_svc_def, 2> companionServices{};

void enqueue(const RawEvent& event);
RawEvent hidReadinessEvent(std::uint16_t connectionHandle);

int appendGattValue(os_mbuf* destination, const void* value, std::size_t size) {
    return os_mbuf_append(destination, value, static_cast<std::uint16_t>(size)) == 0
               ? 0
               : BLE_ATT_ERR_INSUFFICIENT_RES;
}

int readOneByte(os_mbuf* source, std::uint8_t& value) {
    if (OS_MBUF_PKTLEN(source) != 1) {
        return BLE_ATT_ERR_INVALID_ATTR_VALUE_LEN;
    }
    return ble_hs_mbuf_to_flat(source, &value, sizeof(value), nullptr) == 0 ? 0
                                                                            : BLE_ATT_ERR_UNLIKELY;
}

int hidGattAccess(std::uint16_t connectionHandle, std::uint16_t, ble_gatt_access_ctxt* access,
                  void* tag) {
    if (access == nullptr) {
        return BLE_ATT_ERR_UNLIKELY;
    }
    if (access->op == BLE_GATT_ACCESS_OP_READ_DSC) {
        if (tag == keyboardInputDescriptors[0].arg) {
            return appendGattValue(access->om, keyboardInputReference.data(),
                                   keyboardInputReference.size());
        }
        if (tag == keyboardOutputDescriptors[0].arg) {
            return appendGattValue(access->om, keyboardOutputReference.data(),
                                   keyboardOutputReference.size());
        }
        if (tag == consumerInputDescriptors[0].arg) {
            return appendGattValue(access->om, consumerInputReference.data(),
                                   consumerInputReference.size());
        }
        return BLE_ATT_ERR_UNLIKELY;
    }
    if (access->op == BLE_GATT_ACCESS_OP_READ_CHR) {
        if (tag == &hidInformationTag) {
            return appendGattValue(access->om, hidInformation.data(), hidInformation.size());
        }
        if (tag == &hidReportMapTag) {
            return appendGattValue(access->om, hidReportMap.data(), hidReportMap.size());
        }
        if (tag == &hidProtocolModeTag) {
            return appendGattValue(access->om, &context.hidProtocolMode,
                                   sizeof(context.hidProtocolMode));
        }
        if (tag == &keyboardInputTag) {
            constexpr std::array<std::uint8_t, 8> neutral{};
            return appendGattValue(access->om, neutral.data(), neutral.size());
        }
        if (tag == &keyboardOutputTag) {
            constexpr std::uint8_t neutral = 0;
            return appendGattValue(access->om, &neutral, sizeof(neutral));
        }
        if (tag == &consumerInputTag) {
            constexpr std::array<std::uint8_t, 2> neutral{};
            return appendGattValue(access->om, neutral.data(), neutral.size());
        }
        return BLE_ATT_ERR_READ_NOT_PERMITTED;
    }
    if (access->op == BLE_GATT_ACCESS_OP_WRITE_CHR) {
        if (tag == &hidProtocolModeTag) {
            std::uint8_t mode = 0;
            const auto result = readOneByte(access->om, mode);
            if (result != 0) {
                return result;
            }
            if (mode > 1) {
                return BLE_ATT_ERR_VALUE_NOT_ALLOWED;
            }
            portENTER_CRITICAL(&context.mutex);
            context.hidProtocolMode = mode;
            portEXIT_CRITICAL(&context.mutex);
            enqueue(hidReadinessEvent(connectionHandle));
            return 0;
        }
        if (tag == &hidControlPointTag) {
            std::uint8_t control = 0;
            const auto result = readOneByte(access->om, control);
            if (result != 0) {
                return result;
            }
            if (control > 1) {
                return BLE_ATT_ERR_VALUE_NOT_ALLOWED;
            }
            context.hidControlPoint = control;
            return 0;
        }
        if (tag == &keyboardOutputTag) {
            std::uint8_t ignored = 0;
            return readOneByte(access->om, ignored);
        }
        return BLE_ATT_ERR_WRITE_NOT_PERMITTED;
    }
    return BLE_ATT_ERR_UNLIKELY;
}

void clearCompanionIncomingLocked() {
    context.companionIncomingHead = 0;
    context.companionIncomingTail = 0;
    context.companionIncomingCount = 0;
}

bool enqueueCompanionIncoming(os_mbuf* source) {
    connectivity::CompanionChunk chunk{};
    const auto length = OS_MBUF_PKTLEN(source);
    if (length < connectivity::companionChunkHeaderSize || length > chunk.bytes.size()) {
        return false;
    }
    if (ble_hs_mbuf_to_flat(source, chunk.bytes.data(), chunk.bytes.size(), nullptr) != 0) {
        return false;
    }
    chunk.size = static_cast<std::uint16_t>(length);
    portENTER_CRITICAL(&context.mutex);
    if (context.companionIncomingCount == context.companionIncoming.size()) {
        context.companionIncomingOverflow = true;
        clearCompanionIncomingLocked();
        portEXIT_CRITICAL(&context.mutex);
        return false;
    }
    context.companionIncoming[context.companionIncomingTail] = chunk;
    context.companionIncomingTail =
        (context.companionIncomingTail + 1) % context.companionIncoming.size();
    ++context.companionIncomingCount;
    portEXIT_CRITICAL(&context.mutex);
    return true;
}

int companionGattAccess(std::uint16_t, std::uint16_t, ble_gatt_access_ctxt* access, void* tag) {
    if (access == nullptr) {
        return BLE_ATT_ERR_UNLIKELY;
    }
    if (access->op == BLE_GATT_ACCESS_OP_WRITE_CHR && tag == &companionHostToDeviceTag) {
        return enqueueCompanionIncoming(access->om) ? 0 : BLE_ATT_ERR_INSUFFICIENT_RES;
    }
    return BLE_ATT_ERR_UNLIKELY;
}

