fat23cat/cardputer-hub/src/hardware/esp32/bluetooth/esp32_bluetooth_adapter.cpp
void configureReportDescriptor(std::array<ble_gatt_dsc_def, 2>& descriptors) {
    descriptors = {};
    descriptors[0].uuid = &hidReportReferenceUuid.u;
    descriptors[0].att_flags = BLE_ATT_F_READ | BLE_ATT_F_READ_ENC | BLE_ATT_F_READ_AUTHEN;
    descriptors[0].access_cb = hidGattAccess;
    descriptors[0].arg = &descriptors[0];
}

void configureHidCharacteristic(std::size_t index, const ble_uuid_t* uuid, void* tag,
                                ble_gatt_chr_flags flags, std::uint16_t* valueHandle,
                                ble_gatt_dsc_def* descriptors = nullptr) {
    auto& characteristic = hidCharacteristics[index];
    characteristic = {};
    characteristic.uuid = uuid;
    characteristic.access_cb = hidGattAccess;
    characteristic.arg = tag;
    characteristic.descriptors = descriptors;
    characteristic.flags = flags;
    characteristic.val_handle = valueHandle;
}

bool initializeHidService() {
    context.keyboardInputHandle = 0;
    context.keyboardOutputHandle = 0;
    context.consumerInputHandle = 0;
    context.keyboardSubscribed = false;
    context.consumerSubscribed = false;
    context.hidProtocolMode = 1;
    context.hidControlPoint = 1;
    configureReportDescriptor(keyboardInputDescriptors);
    configureReportDescriptor(keyboardOutputDescriptors);
    configureReportDescriptor(consumerInputDescriptors);

    constexpr ble_gatt_chr_flags secureRead =
        BLE_GATT_CHR_F_READ | BLE_GATT_CHR_F_READ_ENC | BLE_GATT_CHR_F_READ_AUTHEN;
    constexpr ble_gatt_chr_flags secureWrite =
        BLE_GATT_CHR_F_WRITE_NO_RSP | BLE_GATT_CHR_F_WRITE_ENC | BLE_GATT_CHR_F_WRITE_AUTHEN;
    constexpr ble_gatt_chr_flags secureNotify = secureRead | BLE_GATT_CHR_F_NOTIFY |
                                                BLE_GATT_CHR_F_NOTIFY_INDICATE_ENC |
                                                BLE_GATT_CHR_F_NOTIFY_INDICATE_AUTHEN;
    configureHidCharacteristic(0, &hidProtocolModeUuid.u, &hidProtocolModeTag,
                               secureRead | secureWrite, nullptr);
    configureHidCharacteristic(1, &hidReportMapUuid.u, &hidReportMapTag, secureRead, nullptr);
    configureHidCharacteristic(2, &hidReportUuid.u, &keyboardInputTag, secureNotify,
                               &context.keyboardInputHandle, keyboardInputDescriptors.data());
    configureHidCharacteristic(3, &hidReportUuid.u, &keyboardOutputTag,
                               secureRead | secureWrite | BLE_GATT_CHR_F_WRITE,
                               &context.keyboardOutputHandle, keyboardOutputDescriptors.data());
    configureHidCharacteristic(4, &hidReportUuid.u, &consumerInputTag, secureNotify,
                               &context.consumerInputHandle, consumerInputDescriptors.data());
    configureHidCharacteristic(5, &hidInformationUuid.u, &hidInformationTag, secureRead, nullptr);
    configureHidCharacteristic(6, &hidControlPointUuid.u, &hidControlPointTag, secureWrite,
                               nullptr);
    hidCharacteristics[7] = {};

    hidServices = {};
    hidServices[0].type = BLE_GATT_SVC_TYPE_PRIMARY;
    hidServices[0].uuid = &hidServiceUuid.u;
    hidServices[0].characteristics = hidCharacteristics.data();
    if (ble_gatts_count_cfg(hidServices.data()) != 0 ||
        ble_gatts_add_svcs(hidServices.data()) != 0 ||
        ble_svc_gap_device_appearance_set(keyboardAppearance) != 0) {
        return false;
    }
    context.hidServiceRegistered = true;
    return true;
}

void loadCompanionUuid(ble_uuid128_t& uuid, const std::array<std::uint8_t, 16>& bytes) {
    uuid = {};
    uuid.u.type = BLE_UUID_TYPE_128;
    std::memcpy(uuid.value, bytes.data(), bytes.size());
}

bool initializeCompanionService() {
    loadCompanionUuid(companionServiceUuid, connectivity::companionServiceUuidBytes);
    loadCompanionUuid(companionHostToDeviceUuid, connectivity::companionHostToDeviceUuidBytes);
    loadCompanionUuid(companionDeviceToHostUuid, connectivity::companionDeviceToHostUuidBytes);
    context.companionNotifyHandle = 0;
    context.companionSubscribed = false;
    context.companionIncoming = {};
    context.companionIncomingHead = 0;
    context.companionIncomingTail = 0;
    context.companionIncomingCount = 0;
    context.companionIncomingOverflow = false;

    constexpr ble_gatt_chr_flags secureWrite =
        BLE_GATT_CHR_F_WRITE | BLE_GATT_CHR_F_WRITE_ENC | BLE_GATT_CHR_F_WRITE_AUTHEN;
    constexpr ble_gatt_chr_flags secureNotify =
        BLE_GATT_CHR_F_NOTIFY | BLE_GATT_CHR_F_READ | BLE_GATT_CHR_F_READ_ENC |
        BLE_GATT_CHR_F_READ_AUTHEN | BLE_GATT_CHR_F_NOTIFY_INDICATE_ENC |
        BLE_GATT_CHR_F_NOTIFY_INDICATE_AUTHEN;
    companionCharacteristics = {};
    companionCharacteristics[0].uuid = &companionHostToDeviceUuid.u;
    companionCharacteristics[0].access_cb = companionGattAccess;
    companionCharacteristics[0].arg = &companionHostToDeviceTag;
    companionCharacteristics[0].flags = secureWrite;
    companionCharacteristics[1].uuid = &companionDeviceToHostUuid.u;
    companionCharacteristics[1].access_cb = companionGattAccess;
    companionCharacteristics[1].arg = &companionDeviceToHostTag;
    companionCharacteristics[1].flags = secureNotify;
    companionCharacteristics[1].val_handle = &context.companionNotifyHandle;
    companionServices = {};
    companionServices[0].type = BLE_GATT_SVC_TYPE_PRIMARY;
    companionServices[0].uuid = &companionServiceUuid.u;
    companionServices[0].characteristics = companionCharacteristics.data();
    if (ble_gatts_count_cfg(companionServices.data()) != 0 ||
        ble_gatts_add_svcs(companionServices.data()) != 0) {
        return false;
    }
    context.companionServiceRegistered = true;
    return true;
}

void deinitializeHidService() {
    context.hidServiceRegistered = false;
    context.companionServiceRegistered = false;
    context.keyboardSubscribed = false;
    context.consumerSubscribed = false;
    context.companionSubscribed = false;
    context.hidSecurity = {};
    context.keyboardInputHandle = 0;
    context.keyboardOutputHandle = 0;
    context.consumerInputHandle = 0;
    context.companionNotifyHandle = 0;
    context.companionIncomingCount = 0;
    context.companionIncomingOverflow = false;
    context.companionIncomingHead = 0;
    context.companionIncomingTail = 0;
}

