fat23cat/cardputer-hub/src/hardware/esp32/bluetooth/esp32_bluetooth_adapter.cpp
void enqueue(const RawEvent& event) {
    portENTER_CRITICAL(&context.mutex);
    if (context.eventCount == context.events.size()) {
        context.queueOverflow = true;
    } else {
        context.events[context.eventTail] = event;
        context.eventTail = (context.eventTail + 1) % context.events.size();
        ++context.eventCount;
    }
    portEXIT_CRITICAL(&context.mutex);
}

void latchQueueOverflow() {
    portENTER_CRITICAL(&context.mutex);
    context.queueOverflow = true;
    portEXIT_CRITICAL(&context.mutex);
}

std::uint32_t currentLifecycle() {
    portENTER_CRITICAL(&context.mutex);
    const auto lifecycle = context.lifecycle;
    portEXIT_CRITICAL(&context.mutex);
    return lifecycle;
}

void setLifecycle(std::uint32_t lifecycle) {
    portENTER_CRITICAL(&context.mutex);
    context.lifecycle = lifecycle;
    portEXIT_CRITICAL(&context.mutex);
}

bool isHostRunning() {
    portENTER_CRITICAL(&context.mutex);
    const bool running = context.hostRunning;
    portEXIT_CRITICAL(&context.mutex);
    return running;
}

std::uint16_t activeConnectionHandle() {
    portENTER_CRITICAL(&context.mutex);
    const auto connectionHandle = context.peerEventOrder.active().value_or(invalidConnectionHandle);
    portEXIT_CRITICAL(&context.mutex);
    return connectionHandle;
}

void resetHidPeerState() {
    portENTER_CRITICAL(&context.mutex);
    context.keyboardSubscribed = false;
    context.consumerSubscribed = false;
    context.companionSubscribed = false;
    context.hidSecurity = {};
    context.hidProtocolMode = 1;
    context.hidControlPoint = 1;
    context.companionIncomingCount = 0;
    context.companionIncomingOverflow = false;
    context.companionIncomingHead = 0;
    context.companionIncomingTail = 0;
    portEXIT_CRITICAL(&context.mutex);
}

void updateHidSecurity(const connectivity::BluetoothSecurityProperties& security) {
    portENTER_CRITICAL(&context.mutex);
    context.hidSecurity = security;
    portEXIT_CRITICAL(&context.mutex);
}

void updateHidSubscription(std::uint16_t attributeHandle, bool subscribed) {
    portENTER_CRITICAL(&context.mutex);
    if (attributeHandle == context.keyboardInputHandle) {
        context.keyboardSubscribed = subscribed;
    } else if (attributeHandle == context.consumerInputHandle) {
        context.consumerSubscribed = subscribed;
    } else if (attributeHandle == context.companionNotifyHandle) {
        context.companionSubscribed = subscribed;
    }
    portEXIT_CRITICAL(&context.mutex);
}

RawEvent hidReadinessEvent(std::uint16_t connectionHandle) {
    RawEvent event{};
    event.type = RawEventType::HidReadinessChanged;
    event.lifecycle = currentLifecycle();
    event.connectionHandle = connectionHandle;
    portENTER_CRITICAL(&context.mutex);
    event.security = context.hidSecurity;
    event.keyboardSubscribed = context.keyboardSubscribed;
    event.consumerSubscribed = context.consumerSubscribed;
    event.companionSubscribed = context.companionSubscribed;
    event.reportProtocol = context.hidProtocolMode == 1;
    portEXIT_CRITICAL(&context.mutex);
    return event;
}

Esp32BluetoothAdapter* currentOwner() {
    portENTER_CRITICAL(&context.mutex);
    auto* owner = context.owner;
    portEXIT_CRITICAL(&context.mutex);
    return owner;
}

void setOwner(Esp32BluetoothAdapter* owner) {
    portENTER_CRITICAL(&context.mutex);
    context.owner = owner;
    portEXIT_CRITICAL(&context.mutex);
}

bool takeOverflow() {
    portENTER_CRITICAL(&context.mutex);
    const bool overflow = context.queueOverflow;
    context.queueOverflow = false;
    portEXIT_CRITICAL(&context.mutex);
    return overflow;
}

bool dequeue(RawEvent& event) {
    portENTER_CRITICAL(&context.mutex);
    if (context.eventCount == 0) {
        portEXIT_CRITICAL(&context.mutex);
        return false;
    }
    event = context.events[context.eventHead];
    context.eventHead = (context.eventHead + 1) % context.events.size();
    --context.eventCount;
    portEXIT_CRITICAL(&context.mutex);
    return true;
}

void clearLifecycleState() {
    portENTER_CRITICAL(&context.mutex);
    context.eventHead = 0;
    context.eventTail = 0;
    context.eventCount = 0;
    context.queueOverflow = false;
    context.lifecycle = 0;
    context.peerEventOrder.reset();
    context.hostStartupComplete = false;
    portEXIT_CRITICAL(&context.mutex);
    context.synchronized = false;
    context.advertisingRequested = false;
    context.advertisingActive = false;
    context.advertisingStopRequested = false;
    context.ownAddressType = BLE_OWN_ADDR_PUBLIC;
    context.deviceName.clear();
    context.advertisingTarget.reset();
    context.peers = {};
    context.referenceKey.fill(0);
    context.referenceKeyLoaded = false;
    deinitializeHidService();
}

void onHostSynchronized() {
    portENTER_CRITICAL(&context.mutex);
    context.hostStartupComplete = true;
    portEXIT_CRITICAL(&context.mutex);
    if (currentOwner() != nullptr) {
        enqueue({RawEventType::HostSynchronized, currentLifecycle()});
    }
}

void onHostReset(int reason) {
    if (currentOwner() != nullptr) {
        enqueue({RawEventType::HostFailed, currentLifecycle(), reason});
    }
}

bool preparePeerEvent(std::uint16_t connectionHandle, PeerEventKind kind, std::uint32_t lifecycle) {
    portENTER_CRITICAL(&context.mutex);
    const auto disposition = context.peerEventOrder.observe(connectionHandle, kind);
    portEXIT_CRITICAL(&context.mutex);
    if (disposition == PeerEventDisposition::Ignore) {
        return false;
    }
    if (disposition == PeerEventDisposition::Reject) {
        enqueue({RawEventType::HostFailed, lifecycle});
        return false;
    }
    if (disposition == PeerEventDisposition::AnnounceConnection) {
        // ESP-NimBLE can deliver security and restored CCCDs before CONNECT
        // (which waits for remote feature discovery). Announce the live peer
        // first so those events cannot be dropped or reset by a late CONNECT.
        ble_gap_conn_desc descriptor{};
        if (ble_gap_conn_find(connectionHandle, &descriptor) != 0) {
            enqueue({RawEventType::HostFailed, lifecycle});
            return false;
        }
        resetHidPeerState();
        RawEvent connected{};
        connected.type = RawEventType::PeerConnected;
        connected.lifecycle = lifecycle;
        connected.connectionHandle = connectionHandle;
        connected.identityAddress = descriptor.peer_id_addr;
        enqueue(connected);
    }
    return kind != PeerEventKind::Connected;
}

