fat23cat/cardputer-hub/src/hardware/esp32/bluetooth/esp32_bluetooth_adapter.cpp
int gapEventCallback(ble_gap_event* event, void*) {
    if (event == nullptr || currentOwner() == nullptr) {
        if (currentOwner() != nullptr) {
            latchQueueOverflow();
        }
        return 0;
    }

    RawEvent queued{};
    queued.lifecycle = currentLifecycle();
    switch (event->type) {
    case BLE_GAP_EVENT_CONNECT:
        if (event->connect.status != 0) {
            // A link lost before NimBLE's delayed CONNECT is reported as a
            // failed CONNECT, even if we already announced its early events.
            if (activeConnectionHandle() == event->connect.conn_handle) {
                queued.type = RawEventType::PeerDisconnected;
                queued.connectionHandle = event->connect.conn_handle;
                if (preparePeerEvent(queued.connectionHandle, PeerEventKind::Disconnected,
                                     queued.lifecycle)) {
                    enqueue(queued);
                    resetHidPeerState();
                }
                return 0;
            }
            queued.type = RawEventType::AdvertisingCompleted;
            queued.status = event->connect.status;
            enqueue(queued);
            return 0;
        }
        (void)preparePeerEvent(event->connect.conn_handle, PeerEventKind::Connected,
                               queued.lifecycle);
        return 0;
    case BLE_GAP_EVENT_DISCONNECT:
        queued.type = RawEventType::PeerDisconnected;
        queued.connectionHandle = event->disconnect.conn.conn_handle;
        queued.status = event->disconnect.reason;
        if (!preparePeerEvent(queued.connectionHandle, PeerEventKind::Disconnected,
                              queued.lifecycle)) {
            return 0;
        }
        enqueue(queued);
        resetHidPeerState();
        return 0;
    case BLE_GAP_EVENT_IDENTITY_RESOLVED:
        queued.type = RawEventType::PeerIdentityResolved;
        queued.connectionHandle = event->identity_resolved.conn_handle;
        if (!preparePeerEvent(queued.connectionHandle, PeerEventKind::Data, queued.lifecycle)) {
            return 0;
        }
        queued.identityAddress = event->identity_resolved.peer_id_addr;
        enqueue(queued);
        return 0;
    case BLE_GAP_EVENT_PASSKEY_ACTION:
        queued.connectionHandle = event->passkey.conn_handle;
        if (!preparePeerEvent(queued.connectionHandle, PeerEventKind::Data, queued.lifecycle)) {
            return 0;
        }
        queued.securityAction = event->passkey.params.action;
        if (queued.securityAction == BLE_SM_IOACT_DISP) {
            queued.securityValue = esp_random() % 1'000'000U;
        } else if (queued.securityAction == BLE_SM_IOACT_NUMCMP) {
            queued.securityValue = event->passkey.params.numcmp;
        } else if (queued.securityAction != BLE_SM_IOACT_INPUT) {
            queued.type = RawEventType::SecurityCompleted;
            enqueue(queued);
            return 0;
        }
        queued.type = RawEventType::SecurityChallenge;
        enqueue(queued);
        return 0;
    case BLE_GAP_EVENT_ENC_CHANGE: {
        queued.type = RawEventType::SecurityCompleted;
        queued.connectionHandle = event->enc_change.conn_handle;
        if (!preparePeerEvent(queued.connectionHandle, PeerEventKind::Data, queued.lifecycle)) {
            return 0;
        }
        queued.status = event->enc_change.status;
        ble_gap_conn_desc descriptor{};
        if (queued.status == 0 && ble_gap_conn_find(queued.connectionHandle, &descriptor) == 0) {
            queued.security.encrypted = descriptor.sec_state.encrypted != 0;
            queued.security.authenticated = descriptor.sec_state.authenticated != 0;
            queued.security.bonded = descriptor.sec_state.bonded != 0;
            ble_svc_gatt_changed(0x0001, 0xFFFF);
        }
        updateHidSecurity(queued.security);
        enqueue(queued);
        enqueue(hidReadinessEvent(queued.connectionHandle));
        return 0;
    }
    case BLE_GAP_EVENT_SUBSCRIBE:
        if (!preparePeerEvent(event->subscribe.conn_handle, PeerEventKind::Data,
                              queued.lifecycle)) {
            return 0;
        }
        if (event->subscribe.attr_handle == context.keyboardInputHandle ||
            event->subscribe.attr_handle == context.consumerInputHandle ||
            event->subscribe.attr_handle == context.companionNotifyHandle) {
            updateHidSubscription(event->subscribe.attr_handle, event->subscribe.cur_notify != 0);
            enqueue(hidReadinessEvent(event->subscribe.conn_handle));
        }
        return 0;
    case BLE_GAP_EVENT_REPEAT_PAIRING:
        return BLE_GAP_REPEAT_PAIRING_IGNORE;
    case BLE_GAP_EVENT_ADV_COMPLETE:
        queued.type = RawEventType::AdvertisingCompleted;
        queued.status = event->adv_complete.reason;
        enqueue(queued);
        return 0;
    default:
        return 0;
    }
}

void nimbleHostTask(void*) {
    context.hostTaskHandle = xTaskGetCurrentTaskHandle();
    nimble_port_run();
    context.hostTaskHandle = nullptr;
    portENTER_CRITICAL(&context.mutex);
    context.hostRunning = false;
    portEXIT_CRITICAL(&context.mutex);
    xSemaphoreGive(context.hostStopped);
    vTaskDelete(nullptr);
}

constexpr bool isRetryableAdvertisingError(int error) {
    switch (error) {
    case BLE_HS_EAGAIN:
    case BLE_HS_ENOMEM:
    case BLE_HS_ETIMEOUT:
    case BLE_HS_ETIMEOUT_HCI:
    case BLE_HS_ENOMEM_EVT:
    case BLE_HS_EBUSY:
        return true;
    default:
        return false;
    }
}

static_assert(isRetryableAdvertisingError(BLE_HS_EBUSY));
static_assert(isRetryableAdvertisingError(BLE_HS_ETIMEOUT));
static_assert(!isRetryableAdvertisingError(BLE_HS_EINVAL));
static_assert(!isRetryableAdvertisingError(BLE_HS_EALREADY));

connectivity::BluetoothFailureClass classifyAdvertisingError(int error) {
    return isRetryableAdvertisingError(error) ? connectivity::BluetoothFailureClass::Retryable
                                              : connectivity::BluetoothFailureClass::Fatal;
}

bool findBondAddress(const connectivity::BluetoothBondReference& requested, ble_addr_t& address);

connectivity::BluetoothAdvertisingResult issueAdvertisingStart() {
    ble_hs_adv_fields fields{};
    fields.flags = BLE_HS_ADV_F_DISC_GEN | BLE_HS_ADV_F_BREDR_UNSUP;
    fields.uuids16 = &hidServiceUuid;
    fields.num_uuids16 = 1;
    fields.uuids16_is_complete = 1;
    fields.appearance = keyboardAppearance;
    fields.appearance_is_present = 1;
    const auto advertisedNameLength =
        std::min(context.deviceName.size(), maximumLegacyAdvertisingNameLength);
    fields.name = reinterpret_cast<const std::uint8_t*>(context.deviceName.data());
    fields.name_len = static_cast<std::uint8_t>(advertisedNameLength);
    fields.name_is_complete = advertisedNameLength == context.deviceName.size();
    int result = ble_gap_adv_set_fields(&fields);
    if (result != 0) {
        context.advertisingRequested = false;
        return isRetryableAdvertisingError(result)
                   ? connectivity::BluetoothAdvertisingResult::RetryableFailure
                   : connectivity::BluetoothAdvertisingResult::AdapterError;
    }
    ble_hs_adv_fields response{};
    response.uuids128 = &companionServiceUuid;
    response.num_uuids128 = 1;
    response.uuids128_is_complete = 1;
    result = ble_gap_adv_rsp_set_fields(&response);
    if (result != 0) {
        context.advertisingRequested = false;
        return isRetryableAdvertisingError(result)
                   ? connectivity::BluetoothAdvertisingResult::RetryableFailure
                   : connectivity::BluetoothAdvertisingResult::AdapterError;
    }

    ble_gap_adv_params parameters{};
    parameters.conn_mode = BLE_GAP_CONN_MODE_UND;
    parameters.disc_mode = BLE_GAP_DISC_MODE_GEN;
    if (context.advertisingTarget) {
        ble_addr_t target{};
        if (!findBondAddress(*context.advertisingTarget, target)) {
            context.advertisingRequested = false;
            return connectivity::BluetoothAdvertisingResult::AdapterError;
        }
        target.type &= 1; // Controller list uses public/random identity address types.
        result = ble_gap_wl_set(&target, 1);
        if (result != 0) {
            context.advertisingRequested = false;
            return isRetryableAdvertisingError(result)
                       ? connectivity::BluetoothAdvertisingResult::RetryableFailure
                       : connectivity::BluetoothAdvertisingResult::AdapterError;
        }
        parameters.filter_policy = BLE_HCI_ADV_FILT_CONN;
    }
    result = ble_gap_adv_start(context.ownAddressType, nullptr, BLE_HS_FOREVER, &parameters,
                               gapEventCallback, nullptr);
    if (result != 0) {
        context.advertisingRequested = false;
        return isRetryableAdvertisingError(result)
                   ? connectivity::BluetoothAdvertisingResult::RetryableFailure
                   : connectivity::BluetoothAdvertisingResult::AdapterError;
    }
    context.advertisingActive = true;
    enqueue({RawEventType::AdvertisingStarted, currentLifecycle()});
    return connectivity::BluetoothAdvertisingResult::Started;
}

PeerRecord* findPeer(connectivity::BluetoothPeerHandle handle) {
    const auto peer =
        std::find_if(context.peers.begin(), context.peers.end(), [handle](const auto& candidate) {
            return candidate.used && candidate.handle == handle;
        });
    return peer == context.peers.end() ? nullptr : &*peer;
}

PeerRecord* findPeer(std::uint16_t connectionHandle) {
    const auto peer = std::find_if(
        context.peers.begin(), context.peers.end(), [connectionHandle](const auto& candidate) {
            return candidate.used && candidate.connectionHandle == connectionHandle;
        });
    return peer == context.peers.end() ? nullptr : &*peer;
}

PeerRecord* addPeer(const RawEvent& event) {
    const auto peer = std::find_if(context.peers.begin(), context.peers.end(),
                                   [](const auto& candidate) { return !candidate.used; });
    if (peer == context.peers.end()) {
        return nullptr;
    }
    peer->used = true;
    peer->handle = {context.nextPeerHandle++};
    if (context.nextPeerHandle == 0) {
        context.nextPeerHandle = 1;
    }
    peer->connectionHandle = event.connectionHandle;
    peer->identityAddress = event.identityAddress;
    return &*peer;
}

bool ensureReferenceKey() {
    if (nvs_flash_init_partition(configurationPartition) != ESP_OK) {
        return false;
    }
    nvs_handle_t handle{};
    if (nvs_open_from_partition(configurationPartition, bluetoothMetadataNamespace, NVS_READWRITE,
                                &handle) != ESP_OK) {
        return false;
    }

    std::size_t size = context.referenceKey.size();
    const auto readResult =
        nvs_get_blob(handle, referenceKeyName, context.referenceKey.data(), &size);
    if (readResult == ESP_OK) {
        nvs_close(handle);
        context.referenceKeyLoaded = size == context.referenceKey.size();
        return context.referenceKeyLoaded;
    }
    if (readResult != ESP_ERR_NVS_NOT_FOUND) {
        nvs_close(handle);
        return false;
    }

    esp_fill_random(context.referenceKey.data(), context.referenceKey.size());
    const bool stored = nvs_set_blob(handle, referenceKeyName, context.referenceKey.data(),
                                     context.referenceKey.size()) == ESP_OK &&
                        nvs_commit(handle) == ESP_OK;
    nvs_close(handle);
    if (!stored) {
        context.referenceKey.fill(0);
        return false;
    }
    context.referenceKeyLoaded = true;
    return true;
}

bool deriveReference(const ble_addr_t& identityAddress,
                     connectivity::BluetoothBondReference& reference) {
    if (!context.referenceKeyLoaded) {
        return false;
    }
    std::array<std::uint8_t, sizeof(identityAddress.type) + sizeof(identityAddress.val)> input{};
    input.front() = identityAddress.type;
    std::copy(std::begin(identityAddress.val), std::end(identityAddress.val), input.begin() + 1);
    std::array<std::uint8_t, 32> digest{};
    const auto* sha256 = mbedtls_md_info_from_type(MBEDTLS_MD_SHA256);
    if (sha256 == nullptr ||
        mbedtls_md_hmac(sha256, context.referenceKey.data(), context.referenceKey.size(),
                        input.data(), input.size(), digest.data()) != 0) {
        return false;
    }
    std::copy_n(digest.begin(), reference.bytes.size(), reference.bytes.begin());
    return true;
}

bool enumerateBondAddresses(std::array<ble_addr_t, bondCapacity>& addresses, int& count) {
    count = 0;
    const int result =
        ble_store_util_bonded_peers(addresses.data(), &count, static_cast<int>(addresses.size()));
    if (result != 0)
        ESP_LOGE("hub_ble", "bond enumeration failed: rc=%d", result);
    return result == 0 && count >= 0 && static_cast<std::size_t>(count) <= addresses.size();
}

connectivity::BluetoothBondListResult enumerateBondReferences() {
    std::array<ble_addr_t, bondCapacity> addresses{};
    int count = 0;
    if (!context.referenceKeyLoaded || !enumerateBondAddresses(addresses, count)) {
        return {connectivity::BluetoothBondListStatus::AdapterError, {}};
    }
    std::vector<connectivity::BluetoothBondReference> references;
    references.reserve(static_cast<std::size_t>(count));
    for (int index = 0; index < count; ++index) {
        connectivity::BluetoothBondReference reference{};
        if (!deriveReference(addresses[static_cast<std::size_t>(index)], reference) ||
            std::find(references.begin(), references.end(), reference) != references.end()) {
            return {connectivity::BluetoothBondListStatus::AdapterError, {}};
        }
        references.push_back(reference);
    }
    std::sort(references.begin(), references.end());
    return {connectivity::BluetoothBondListStatus::Success, std::move(references)};
}

std::optional<connectivity::BluetoothSecurityProperties>
storedBondSecurity(const PeerRecord& peer) {
    ble_store_key_sec key{};
    key.peer_addr = peer.identityAddress;
    ble_store_value_sec value{};
    if (ble_store_read_peer_sec(&key, &value) != 0) {
        return std::nullopt;
    }
    return connectivity::BluetoothSecurityProperties{value.sc != 0, false, value.authenticated != 0,
                                                     true};
}

