fat23cat/cardputer-hub/src/hardware/esp32/bluetooth/esp32_bluetooth_adapter.cpp
bool findBondAddress(const connectivity::BluetoothBondReference& requested, ble_addr_t& address) {
    std::array<ble_addr_t, bondCapacity> addresses{};
    int count = 0;
    if (!enumerateBondAddresses(addresses, count)) {
        return false;
    }
    bool found = false;
    for (int index = 0; index < count; ++index) {
        connectivity::BluetoothBondReference candidate{};
        if (!deriveReference(addresses[static_cast<std::size_t>(index)], candidate)) {
            return false;
        }
        if (candidate == requested) {
            if (found) {
                return false;
            }
            address = addresses[static_cast<std::size_t>(index)];
            found = true;
        }
    }
    return found;
}

connectivity::BluetoothPollResult adapterFailure(std::uint32_t lifecycle) {
    return connectivity::BluetoothPollResult::withEvent(
        {connectivity::BluetoothEventType::AdapterFailed,
         {},
         connectivity::BluetoothFailureClass::Fatal,
         lifecycle});
}

bool waitForPeerDisconnection(std::uint16_t connectionHandle) {
    const TickType_t start = xTaskGetTickCount();
    ble_gap_conn_desc descriptor{};
    while (ble_gap_conn_find(connectionHandle, &descriptor) == 0) {
        if (xTaskGetTickCount() - start >= hostStopTimeout) {
            return false;
        }
        vTaskDelay(1);
    }
    return true;
}

bool terminateAndWaitForPeer(std::uint16_t connectionHandle) {
    const int terminateResult = ble_gap_terminate(connectionHandle, BLE_ERR_REM_USER_CONN_TERM);
    if (terminateResult != 0 && terminateResult != BLE_HS_ENOTCONN &&
        terminateResult != BLE_HS_EALREADY) {
        return false;
    }
    return waitForPeerDisconnection(connectionHandle);
}

bool stopAdvertisingAndPeers() {
    context.advertisingRequested = false;
    if (ble_gap_adv_active() != 0) {
        const int stopResult = ble_gap_adv_stop();
        if (stopResult != 0 && stopResult != BLE_HS_EALREADY) {
            return false;
        }
    }
    context.advertisingActive = false;

    // GAP callbacks can precede Service polling. Track that connection separately
    // so shutdown also closes a peer whose queued connect event is not yet consumed.
    const auto callbackConnectionHandle = activeConnectionHandle();
    if (callbackConnectionHandle != invalidConnectionHandle &&
        !terminateAndWaitForPeer(callbackConnectionHandle)) {
        return false;
    }

    const bool processedPeersStopped =
        std::all_of(context.peers.begin(), context.peers.end(), [&](const auto& peer) {
            return !peer.used || peer.connectionHandle == callbackConnectionHandle ||
                   terminateAndWaitForPeer(peer.connectionHandle);
        });
    if (!processedPeersStopped) {
        return false;
    }
    context.peers = {};
    return true;
}

bool waitForHostStartup() {
    const auto start = xTaskGetTickCount();
    for (;;) {
        portENTER_CRITICAL(&context.mutex);
        const bool complete = context.hostStartupComplete;
        portEXIT_CRITICAL(&context.mutex);
        if (complete)
            return true;
        if (xTaskGetTickCount() - start >= hostStopTimeout)
            return false;
        vTaskDelay(pdMS_TO_TICKS(1));
    }
}

bool quiesceStack() {
    if (isHostRunning()) {
        // Idle initialization may be followed immediately by Off. NimBLE's
        // stage-2 startup still owns its timer resources until the first sync.
        // Stopping before that callback races startup; keep ownership on timeout.
        if (!waitForHostStartup())
            return false;
        if (!stopAdvertisingAndPeers()) {
            return false;
        }
        deinitializeHidService();
        if (nimble_port_stop() != 0 ||
            xSemaphoreTake(context.hostStopped, hostStopTimeout) != pdTRUE) {
            return false;
        }
    }
    if (context.hostInitialized) {
        if (esp_nimble_deinit() != ESP_OK) {
            return false;
        }
        context.hostInitialized = false;
    }
    if (context.controllerEnabled) {
        if (esp_bt_controller_disable() != ESP_OK) {
            return false;
        }
        context.controllerEnabled = false;
    }
    context.stackOwned = false;
    clearLifecycleState();
    return true;
}

void suppressIdentityBearingBluetoothLogTags() {
    constexpr std::array tags = {
        "BT",       "BTDM_INIT", "BLE_INIT",    "NimBLE",      "NIMBLE_PORT", "NIMBLE_NVS",
        "ble_hs",   "BLE_HS",    "BLE_ATT",     "BLE_SMP",     "ble_store",   "BT_HIDD",
        "BLE_HIDD", "ESP_HIDH",  "NIMBLE_HIDD", "NIMBLE_HIDH", "hid_parser",
    };
    std::for_each(tags.begin(), tags.end(),
                  [](const auto* tag) { esp_log_level_set(tag, ESP_LOG_NONE); });
}

} // namespace

Esp32BluetoothAdapter::~Esp32BluetoothAdapter() {
    if (currentOwner() == this && quiesceStack()) {
        setOwner(nullptr);
    }
}

connectivity::BluetoothAdapterResult
Esp32BluetoothAdapter::initialize(const connectivity::BluetoothDeviceConfig& config,
                                  std::uint32_t lifecycle) {
    if (lifecycle == 0 || config.deviceName.empty() ||
        config.deviceName.size() > maximumBluetoothDeviceNameLength ||
        config.deviceName.find('\0') != std::string::npos) {
        return connectivity::BluetoothAdapterResult::AdapterError;
    }

    const auto* owner = currentOwner();
    if (owner != nullptr && owner != this) {
        return connectivity::BluetoothAdapterResult::AdapterError;
    }
    if (owner == nullptr) {
        if (esp_bt_controller_get_status() != ESP_BT_CONTROLLER_STATUS_IDLE) {
            return connectivity::BluetoothAdapterResult::AdapterError;
        }
        setOwner(this);
    } else {
        const auto expectedControllerStatus = context.controllerInitialized
                                                  ? ESP_BT_CONTROLLER_STATUS_INITED
                                                  : ESP_BT_CONTROLLER_STATUS_IDLE;
        if (context.stackOwned || context.hostInitialized || isHostRunning() ||
            context.controllerEnabled ||
            esp_bt_controller_get_status() != expectedControllerStatus) {
            return connectivity::BluetoothAdapterResult::AdapterError;
        }
    }

    clearLifecycleState();
    setLifecycle(lifecycle);
    context.deviceName = config.deviceName;
    context.stackOwned = true;
    suppressIdentityBearingBluetoothLogTags();

    if (context.hostStopped == nullptr) {
        context.hostStopped = xSemaphoreCreateBinaryStatic(&context.hostStoppedStorage);
        if (context.hostStopped == nullptr) {
            context.stackOwned = false;
            clearLifecycleState();
            setOwner(nullptr);
            return connectivity::BluetoothAdapterResult::AdapterError;
        }
    }
    if (context.notifyDone == nullptr) {
        context.notifyDone = xSemaphoreCreateBinaryStatic(&context.notifyDoneStorage);
        if (context.notifyDone == nullptr) {
            context.stackOwned = false;
            clearLifecycleState();
            setOwner(nullptr);
            return connectivity::BluetoothAdapterResult::AdapterError;
        }
    }
    while (xSemaphoreTake(context.hostStopped, 0) == pdTRUE) {
    }
    while (xSemaphoreTake(context.notifyDone, 0) == pdTRUE) {
    }

    if (nvs_flash_init() != ESP_OK) {
        context.stackOwned = false;
        clearLifecycleState();
        setOwner(nullptr);
        return connectivity::BluetoothAdapterResult::AdapterError;
    }

    if (!context.controllerInitialized) {
        esp_bt_controller_config_t controllerConfig = BT_CONTROLLER_INIT_CONFIG_DEFAULT();
        if (esp_bt_controller_init(&controllerConfig) != ESP_OK) {
            context.stackOwned = false;
            clearLifecycleState();
            setOwner(nullptr);
            return connectivity::BluetoothAdapterResult::AdapterError;
        }
        context.controllerInitialized = true;
    }
    if (esp_bt_controller_enable(ESP_BT_MODE_BLE) != ESP_OK) {
        (void)quiesceStack();
        return connectivity::BluetoothAdapterResult::AdapterError;
    }
    context.controllerEnabled = true;
    if (esp_nimble_init() != ESP_OK) {
        (void)quiesceStack();
        return connectivity::BluetoothAdapterResult::AdapterError;
    }
    context.hostInitialized = true;

    ble_hs_cfg.reset_cb = onHostReset;
    ble_hs_cfg.sync_cb = onHostSynchronized;
    ble_hs_cfg.store_status_cb = ble_store_util_status_rr;
    ble_hs_cfg.sm_io_cap = BLE_HS_IO_KEYBOARD_DISPLAY;
    ble_hs_cfg.sm_oob_data_flag = 0;
    ble_hs_cfg.sm_bonding = 1;
    ble_hs_cfg.sm_mitm = 1;
    ble_hs_cfg.sm_sc = 1;
    ble_hs_cfg.sm_sc_only = 1;
    ble_hs_cfg.sm_sec_lvl = CONFIG_BT_NIMBLE_SM_LVL;
    ble_hs_cfg.sm_our_key_dist = BLE_HS_KEY_DIST_ENC_KEY | BLE_HS_KEY_DIST_ID_KEY;
    ble_hs_cfg.sm_their_key_dist = BLE_HS_KEY_DIST_ENC_KEY | BLE_HS_KEY_DIST_ID_KEY;
    ble_svc_gap_init();
    ble_svc_gatt_init();
    ble_store_config_init();
    if (!initializeHidService() || !initializeCompanionService()) {
        (void)quiesceStack();
        return connectivity::BluetoothAdapterResult::AdapterError;
    }
    if (!ensureReferenceKey()) {
        (void)quiesceStack();
        return connectivity::BluetoothAdapterResult::AdapterError;
    }
    if (ble_svc_gap_device_name_set(context.deviceName.c_str()) != 0) {
        (void)quiesceStack();
        return connectivity::BluetoothAdapterResult::AdapterError;
    }

