fat23cat/cardputer-hub/src/hardware/esp32/bluetooth/esp32_bluetooth_adapter.cpp
    portENTER_CRITICAL(&context.mutex);
    context.hostRunning = true;
    portEXIT_CRITICAL(&context.mutex);
    if (xTaskCreate(nimbleHostTask, "nimble_host", 4'096, nullptr, configMAX_PRIORITIES - 4,
                    nullptr) != pdPASS) {
        portENTER_CRITICAL(&context.mutex);
        context.hostRunning = false;
        portEXIT_CRITICAL(&context.mutex);
        (void)quiesceStack();
        return connectivity::BluetoothAdapterResult::AdapterError;
    }
    // Stage-2 privacy startup reloads the bond store with STATIC_TO_DYNAMIC.
    // Do not expose a transiently empty registry to immediate host selection.
    if (!waitForHostStartup()) {
        ESP_LOGE("hub_ble", "host startup did not complete before deadline");
        (void)quiesceStack();
        return connectivity::BluetoothAdapterResult::AdapterError;
    }
    return connectivity::BluetoothAdapterResult::Success;
}

connectivity::BluetoothAdapterResult Esp32BluetoothAdapter::shutdown() {
    const auto* owner = currentOwner();
    if (owner == nullptr) {
        return connectivity::BluetoothAdapterResult::Success;
    }
    if (owner != this) {
        return connectivity::BluetoothAdapterResult::AdapterError;
    }
    return quiesceStack() ? connectivity::BluetoothAdapterResult::Success
                          : connectivity::BluetoothAdapterResult::AdapterError;
}

connectivity::BluetoothAdvertisingResult Esp32BluetoothAdapter::startAdvertising(
    std::uint32_t lifecycle, std::optional<connectivity::BluetoothBondReference> target) {
    if (currentOwner() != this || !context.stackOwned || lifecycle == 0 ||
        context.advertisingRequested || context.advertisingActive ||
        context.advertisingStopRequested) {
        return connectivity::BluetoothAdvertisingResult::AdapterError;
    }
    context.advertisingTarget = target;
    setLifecycle(lifecycle);
    context.advertisingRequested = true;
    if (!context.synchronized) {
        return connectivity::BluetoothAdvertisingResult::Started;
    }
    return issueAdvertisingStart();
}

connectivity::BluetoothAdapterResult Esp32BluetoothAdapter::requestAdvertisingStop() {
    if (currentOwner() != this || !context.stackOwned) {
        return connectivity::BluetoothAdapterResult::AdapterError;
    }
    context.advertisingRequested = false;
    if (!context.advertisingActive) {
        return connectivity::BluetoothAdapterResult::Success;
    }
    context.advertisingStopRequested = true;
    const int result = ble_gap_adv_stop();
    if (result != 0 && result != BLE_HS_EALREADY) {
        context.advertisingStopRequested = false;
        return connectivity::BluetoothAdapterResult::AdapterError;
    }
    // In pinned ESP-NimBLE, ble_gap_adv_stop() is synchronous and does not
    // emit ADV_COMPLETE. Do not wait for a callback that will never arrive.
    context.advertisingActive = false;
    context.advertisingStopRequested = false;
    return connectivity::BluetoothAdapterResult::Success;
}

connectivity::BluetoothAdapterResult
Esp32BluetoothAdapter::disconnectPeer(connectivity::BluetoothPeerHandle handle) {
    const auto* peer = findPeer(handle);
    if (currentOwner() != this || !context.stackOwned || peer == nullptr) {
        return connectivity::BluetoothAdapterResult::AdapterError;
    }
    const int result = ble_gap_terminate(peer->connectionHandle, BLE_ERR_REM_USER_CONN_TERM);
    return result == 0 || result == BLE_HS_EALREADY || result == BLE_HS_ENOTCONN
               ? connectivity::BluetoothAdapterResult::Success
               : connectivity::BluetoothAdapterResult::AdapterError;
}

connectivity::BluetoothPollResult Esp32BluetoothAdapter::pollEvent() {
    if (currentOwner() != this || !context.stackOwned || takeOverflow()) {
        return connectivity::BluetoothPollResult::adapterError();
    }

    RawEvent event{};
    while (dequeue(event)) {
        if (event.lifecycle != currentLifecycle()) {
            continue;
        }
        switch (event.type) {
        case RawEventType::HostSynchronized:
            if (ble_hs_util_ensure_addr(0) != 0 ||
                ble_hs_id_infer_auto(0, &context.ownAddressType) != 0) {
                return adapterFailure(event.lifecycle);
            }
            context.synchronized = true;
            if (context.advertisingRequested && !context.advertisingActive) {
                const auto result = issueAdvertisingStart();
                if (result == connectivity::BluetoothAdvertisingResult::RetryableFailure) {
                    return connectivity::BluetoothPollResult::withEvent(
                        {connectivity::BluetoothEventType::AdvertisingFailed,
                         {},
                         connectivity::BluetoothFailureClass::Retryable,
                         event.lifecycle});
                }
                if (result == connectivity::BluetoothAdvertisingResult::AdapterError) {
                    return connectivity::BluetoothPollResult::adapterError();
                }
            }
            break;
        case RawEventType::HostFailed:
            return adapterFailure(event.lifecycle);
        case RawEventType::AdvertisingStarted:
            return connectivity::BluetoothPollResult::withEvent(
                {connectivity::BluetoothEventType::AdvertisingStarted,
                 {},
                 connectivity::BluetoothFailureClass::Fatal,
                 event.lifecycle});
        case RawEventType::AdvertisingCompleted:
            context.advertisingActive = false;
            if (context.advertisingStopRequested) {
                context.advertisingStopRequested = false;
                break;
            }
            context.advertisingRequested = false;
            return connectivity::BluetoothPollResult::withEvent(
                {connectivity::BluetoothEventType::AdvertisingFailed,
                 {},
                 classifyAdvertisingError(event.status),
                 event.lifecycle});
        case RawEventType::PeerConnected: {
            context.advertisingRequested = false;
            context.advertisingActive = false;
            context.advertisingStopRequested = false;
            const auto* peer = addPeer(event);
            if (peer == nullptr) {
                return connectivity::BluetoothPollResult::adapterError();
            }
            return connectivity::BluetoothPollResult::withEvent(
                {connectivity::BluetoothEventType::PeerConnected, peer->handle,
                 connectivity::BluetoothFailureClass::Fatal, event.lifecycle});
        }
        case RawEventType::PeerDisconnected: {
            auto* peer = findPeer(event.connectionHandle);
            if (peer == nullptr) {
                break;
            }
            const auto handle = peer->handle;
            *peer = {};
            return connectivity::BluetoothPollResult::withEvent(
                {connectivity::BluetoothEventType::PeerDisconnected, handle,
                 connectivity::BluetoothFailureClass::Fatal, event.lifecycle});
        }
        case RawEventType::PeerIdentityResolved: {
            auto* peer = findPeer(event.connectionHandle);
            if (peer != nullptr) {
                peer->identityAddress = event.identityAddress;
            }
            break;
        }
        case RawEventType::SecurityChallenge: {
            const auto* peer = findPeer(event.connectionHandle);
            if (peer == nullptr) {
                return connectivity::BluetoothPollResult::adapterError();
            }
            connectivity::BluetoothEvent challenge{
                connectivity::BluetoothEventType::PairingChallenge, peer->handle,
                connectivity::BluetoothFailureClass::Fatal, event.lifecycle};
            switch (event.securityAction) {
            case BLE_SM_IOACT_DISP:
                challenge.challengeType =
                    connectivity::BluetoothPairingChallengeType::DisplayPasskey;
                challenge.challengeValue = event.securityValue;
                break;
            case BLE_SM_IOACT_INPUT:
                challenge.challengeType = connectivity::BluetoothPairingChallengeType::EnterPasskey;
                break;
            case BLE_SM_IOACT_NUMCMP:
                challenge.challengeType =
                    connectivity::BluetoothPairingChallengeType::ConfirmComparison;
                challenge.challengeValue = event.securityValue;
                break;
            default:
                return connectivity::BluetoothPollResult::adapterError();
            }
            return connectivity::BluetoothPollResult::withEvent(challenge);
        }
        case RawEventType::SecurityCompleted: {
            const auto* peer = findPeer(event.connectionHandle);
            if (peer == nullptr) {
                break;
            }
            connectivity::BluetoothEvent completed{
                connectivity::BluetoothEventType::PairingCompleted, peer->handle,
                connectivity::BluetoothFailureClass::Fatal, event.lifecycle};
            completed.security = event.security;
            if (const auto stored = storedBondSecurity(*peer); stored.has_value()) {
                completed.security.bonded = true;
                completed.security.secureConnections = stored->secureConnections;
                completed.security.authenticated =
                    completed.security.authenticated && stored->authenticated;
            }
            return connectivity::BluetoothPollResult::withEvent(completed);
        }
        case RawEventType::HidReadinessChanged: {
            const auto* peer = findPeer(event.connectionHandle);
            if (peer == nullptr) {
                break;
            }
            connectivity::BluetoothEvent readiness{
                connectivity::BluetoothEventType::HidReadinessChanged, peer->handle,
                connectivity::BluetoothFailureClass::Fatal, event.lifecycle};
            readiness.security = event.security;
            if (const auto stored = storedBondSecurity(*peer); stored.has_value()) {
                readiness.security.bonded = true;
                readiness.security.secureConnections = stored->secureConnections;
                readiness.security.authenticated =
                    readiness.security.authenticated && stored->authenticated;
            }
            readiness.keyboardSubscribed = event.keyboardSubscribed;
            readiness.consumerSubscribed = event.consumerSubscribed;
            readiness.companionSubscribed = event.companionSubscribed;
            readiness.reportProtocol = event.reportProtocol;
            return connectivity::BluetoothPollResult::withEvent(readiness);
        }
        }
    }
    return connectivity::BluetoothPollResult::noEvent();
}

connectivity::BluetoothBondQueryResult
Esp32BluetoothAdapter::bondState(connectivity::BluetoothPeerHandle handle) {
    const auto* peer = findPeer(handle);
    if (currentOwner() != this || !context.stackOwned || peer == nullptr) {
        return connectivity::BluetoothBondQueryResult::AdapterError;
    }

    std::array<ble_addr_t, bondCapacity> bondAddresses{};
    int bondCount = 0;
    if (ble_store_util_bonded_peers(bondAddresses.data(), &bondCount,
                                    static_cast<int>(bondAddresses.size())) != 0 ||
        bondCount < 0 || static_cast<std::size_t>(bondCount) > bondAddresses.size()) {
        return connectivity::BluetoothBondQueryResult::AdapterError;
    }
    const auto match = std::find_if(
        bondAddresses.begin(), bondAddresses.begin() + bondCount, [&](const auto& bondAddress) {
            return ble_addr_cmp(&bondAddress, &peer->identityAddress) == 0;
        });
    return match == bondAddresses.begin() + bondCount
               ? connectivity::BluetoothBondQueryResult::Unbonded
               : connectivity::BluetoothBondQueryResult::Bonded;
}

connectivity::BluetoothAdapterResult
Esp32BluetoothAdapter::beginPairing(connectivity::BluetoothPeerHandle handle) {
    const auto* peer = findPeer(handle);
    if (currentOwner() != this || !context.stackOwned || peer == nullptr ||
        !context.referenceKeyLoaded) {
        return connectivity::BluetoothAdapterResult::AdapterError;
    }
    const auto knownBonds = enumerateBondReferences();
    if (knownBonds.status != connectivity::BluetoothBondListStatus::Success ||
        knownBonds.bonds.size() >= bondCapacity) {
        return connectivity::BluetoothAdapterResult::AdapterError;
    }
    return ble_gap_security_initiate(peer->connectionHandle) == 0
               ? connectivity::BluetoothAdapterResult::Success
               : connectivity::BluetoothAdapterResult::AdapterError;
}

connectivity::BluetoothAdapterResult
Esp32BluetoothAdapter::restoreBondSecurity(connectivity::BluetoothPeerHandle handle) {
    const auto* peer = findPeer(handle);
    if (currentOwner() != this || !context.stackOwned || peer == nullptr ||
        bondState(handle) != connectivity::BluetoothBondQueryResult::Bonded) {
        return connectivity::BluetoothAdapterResult::AdapterError;
    }
    ble_gap_conn_desc descriptor{};
    if (ble_gap_conn_find(peer->connectionHandle, &descriptor) != 0) {
        return connectivity::BluetoothAdapterResult::AdapterError;
    }
    if (descriptor.sec_state.encrypted && descriptor.sec_state.authenticated &&
        descriptor.sec_state.bonded) {
        return connectivity::BluetoothAdapterResult::Success;
    }
    // For a bonded peripheral, request the central to restore encryption using
    // the stored keys. A simultaneous central-initiated procedure is already
    // sufficient; new pairing challenges remain subject to the Service window.
    const int result = ble_gap_security_initiate(peer->connectionHandle);
    return result == 0 || result == BLE_HS_EALREADY
               ? connectivity::BluetoothAdapterResult::Success
               : connectivity::BluetoothAdapterResult::AdapterError;
}

connectivity::BluetoothAdapterResult
Esp32BluetoothAdapter::respondToPairing(connectivity::BluetoothPeerHandle handle,
                                        connectivity::BluetoothPairingChallengeType type,
                                        bool accepted, std::optional<std::uint32_t> passkey) {
    const auto* peer = findPeer(handle);
    if (currentOwner() != this || !context.stackOwned || peer == nullptr) {
        return connectivity::BluetoothAdapterResult::AdapterError;
    }
    if (!accepted && type != connectivity::BluetoothPairingChallengeType::ConfirmComparison) {
        return disconnectPeer(handle);
    }

    ble_sm_io response{};
    switch (type) {
    case connectivity::BluetoothPairingChallengeType::DisplayPasskey:
        if (!accepted || !passkey.has_value() || *passkey > 999'999) {
            return connectivity::BluetoothAdapterResult::AdapterError;
        }
        response.action = BLE_SM_IOACT_DISP;
        response.passkey = *passkey;
        break;
    case connectivity::BluetoothPairingChallengeType::EnterPasskey:
        if (!accepted || !passkey.has_value() || *passkey > 999'999) {
            return connectivity::BluetoothAdapterResult::AdapterError;
        }
        response.action = BLE_SM_IOACT_INPUT;
        response.passkey = *passkey;
        break;
    case connectivity::BluetoothPairingChallengeType::ConfirmComparison:
        if (passkey.has_value()) {
            return connectivity::BluetoothAdapterResult::AdapterError;
        }
        response.action = BLE_SM_IOACT_NUMCMP;
        response.numcmp_accept = accepted ? 1 : 0;
        break;
    }
    return ble_sm_inject_io(peer->connectionHandle, &response) == 0
               ? connectivity::BluetoothAdapterResult::Success
               : connectivity::BluetoothAdapterResult::AdapterError;
}

connectivity::BluetoothBondListResult Esp32BluetoothAdapter::bonds() {
    if (currentOwner() != this || !context.stackOwned) {
        return {connectivity::BluetoothBondListStatus::AdapterError, {}};
    }
    return enumerateBondReferences();
}

connectivity::BluetoothBondReferenceResult
Esp32BluetoothAdapter::bondReference(connectivity::BluetoothPeerHandle handle) {
    const auto* peer = findPeer(handle);
    if (currentOwner() != this || !context.stackOwned || peer == nullptr) {
        return {connectivity::BluetoothBondReferenceStatus::AdapterError, {}};
    }
    if (bondState(handle) != connectivity::BluetoothBondQueryResult::Bonded) {
        return {connectivity::BluetoothBondReferenceStatus::NotFound, {}};
    }
    connectivity::BluetoothBondReference reference{};
    if (!deriveReference(peer->identityAddress, reference)) {
        return {connectivity::BluetoothBondReferenceStatus::AdapterError, {}};
    }
    const auto knownBonds = enumerateBondReferences();
    if (knownBonds.status != connectivity::BluetoothBondListStatus::Success ||
        std::count(knownBonds.bonds.begin(), knownBonds.bonds.end(), reference) != 1) {
        return {connectivity::BluetoothBondReferenceStatus::AdapterError, {}};
    }
    return {connectivity::BluetoothBondReferenceStatus::Found, reference};
}

connectivity::BluetoothAdapterResult
Esp32BluetoothAdapter::deleteBond(const connectivity::BluetoothBondReference& reference) {
    if (currentOwner() != this || !context.stackOwned || !context.referenceKeyLoaded) {
        return connectivity::BluetoothAdapterResult::AdapterError;
    }
    ble_addr_t address{};
    if (!findBondAddress(reference, address)) {
        return connectivity::BluetoothAdapterResult::AdapterError;
    }
    return ble_store_util_delete_peer(&address) == 0
               ? connectivity::BluetoothAdapterResult::Success
               : connectivity::BluetoothAdapterResult::AdapterError;
}

connectivity::BluetoothAdapterResult
Esp32BluetoothAdapter::deleteBondForPeer(connectivity::BluetoothPeerHandle handle) {
    const auto* peer = findPeer(handle);
    if (currentOwner() != this || !context.stackOwned || peer == nullptr) {
        return connectivity::BluetoothAdapterResult::AdapterError;
    }
    return ble_store_util_delete_peer(&peer->identityAddress) == 0
               ? connectivity::BluetoothAdapterResult::Success
               : connectivity::BluetoothAdapterResult::AdapterError;
}

connectivity::BluetoothHidAdapterResult
Esp32BluetoothAdapter::hidReadiness(connectivity::BluetoothPeerHandle handle) {
    const auto* peer = findPeer(handle);
    if (currentOwner() != this || !context.stackOwned || !context.hidServiceRegistered ||
        peer == nullptr) {
        return connectivity::BluetoothHidAdapterResult::AdapterError;
    }
    ble_gap_conn_desc descriptor{};
    const auto findResult = ble_gap_conn_find(peer->connectionHandle, &descriptor);
    if (findResult == BLE_HS_ENOTCONN) {
        return connectivity::BluetoothHidAdapterResult::Disconnected;
    }
    if (findResult != 0) {
        return connectivity::BluetoothHidAdapterResult::AdapterError;
    }

