fat23cat/cardputer-hub/src/hardware/esp32/bluetooth/esp32_bluetooth_adapter.cpp
    portENTER_CRITICAL(&context.mutex);
    const bool keyboardSubscribed = context.keyboardSubscribed;
    const bool consumerSubscribed = context.consumerSubscribed;
    const bool reportProtocol = context.hidProtocolMode == 1;
    portEXIT_CRITICAL(&context.mutex);
    return descriptor.sec_state.encrypted != 0 && descriptor.sec_state.authenticated != 0 &&
                   descriptor.sec_state.bonded != 0 && keyboardSubscribed && consumerSubscribed &&
                   reportProtocol
               ? connectivity::BluetoothHidAdapterResult::Ready
               : connectivity::BluetoothHidAdapterResult::NotReady;
}

namespace {

connectivity::BluetoothHidAdapterResult classifyHidSendResult(int result) {
    switch (result) {
    case 0:
        return connectivity::BluetoothHidAdapterResult::Sent;
    case BLE_HS_EAGAIN:
    case BLE_HS_EBUSY:
    case BLE_HS_ENOMEM:
    case BLE_HS_ENOMEM_EVT:
        return connectivity::BluetoothHidAdapterResult::Busy;
    case BLE_HS_ENOTCONN:
        return connectivity::BluetoothHidAdapterResult::Disconnected;
    default:
        return connectivity::BluetoothHidAdapterResult::AdapterError;
    }
}

void runHostNotify(ble_npl_event* ev) {
    auto* request = static_cast<HostNotifyRequest*>(ble_npl_event_get_arg(ev));
    if (request == nullptr) {
        return;
    }
    if (request->payload == nullptr) {
        request->result = BLE_HS_EAGAIN;
    } else if (!esp_vhci_host_check_send_available()) {
        os_mbuf_free_chain(request->payload);
        request->payload = nullptr;
        request->result = BLE_HS_EAGAIN;
    } else {
        request->result = ble_gatts_notify_custom(request->connectionHandle,
                                                  request->attributeHandle, request->payload);
        request->payload = nullptr;
    }
    request->inFlight = false;
    if (context.notifyDone != nullptr) {
        xSemaphoreGive(context.notifyDone);
    }
}

connectivity::BluetoothHidAdapterResult sendHidPayload(std::uint16_t connectionHandle,
                                                       std::uint16_t attributeHandle,
                                                       const void* data, std::size_t size) {
    auto* payload = ble_hs_mbuf_from_flat(data, static_cast<std::uint16_t>(size));
    if (payload == nullptr) {
        return connectivity::BluetoothHidAdapterResult::Busy;
    }
    if (context.hostTaskHandle != nullptr &&
        xTaskGetCurrentTaskHandle() == context.hostTaskHandle) {
        return classifyHidSendResult(
            ble_gatts_notify_custom(connectionHandle, attributeHandle, payload));
    }
    if (context.notifyRequest.inFlight || context.notifyDone == nullptr) {
        os_mbuf_free_chain(payload);
        return connectivity::BluetoothHidAdapterResult::Busy;
    }

    context.notifyRequest =
        HostNotifyRequest{connectionHandle, attributeHandle, payload, BLE_HS_EAGAIN, true};
    ble_npl_event_init(&context.notifyEvent, runHostNotify, &context.notifyRequest);
    auto* eventq = nimble_port_get_dflt_eventq();
    if (eventq == nullptr) {
        os_mbuf_free_chain(payload);
        context.notifyRequest = {};
        return connectivity::BluetoothHidAdapterResult::AdapterError;
    }
    while (xSemaphoreTake(context.notifyDone, 0) == pdTRUE) {
    }
    ble_npl_eventq_put(eventq, &context.notifyEvent);
    if (xSemaphoreTake(context.notifyDone, pdMS_TO_TICKS(2000)) != pdTRUE) {
        return connectivity::BluetoothHidAdapterResult::Busy;
    }
    return classifyHidSendResult(context.notifyRequest.result);
}

} // namespace

connectivity::BluetoothHidAdapterResult
Esp32BluetoothAdapter::sendHidReport(connectivity::BluetoothPeerHandle handle,
                                     const connectivity::HidReport& report) {
    const auto readiness = hidReadiness(handle);
    if (readiness != connectivity::BluetoothHidAdapterResult::Ready) {
        return readiness;
    }
    const auto* peer = findPeer(handle);
    if (peer == nullptr) {
        return connectivity::BluetoothHidAdapterResult::Disconnected;
    }
    if (const auto* keyboard = std::get_if<connectivity::HidKeyboardReport>(&report);
        keyboard != nullptr) {
        std::array<std::uint8_t, 8> payload{};
        payload[0] = keyboard->modifiers;
        std::copy(keyboard->usages.begin(), keyboard->usages.end(), payload.begin() + 2);
        return sendHidPayload(peer->connectionHandle, context.keyboardInputHandle, payload.data(),
                              payload.size());
    }
    const auto consumer = std::get<connectivity::HidConsumerReport>(report);
    const std::array<std::uint8_t, 2> payload{
        static_cast<std::uint8_t>(consumer.usage & 0xFF),
        static_cast<std::uint8_t>((consumer.usage >> 8) & 0xFF),
    };
    return sendHidPayload(peer->connectionHandle, context.consumerInputHandle, payload.data(),
                          payload.size());
}

connectivity::BluetoothHidAdapterResult
Esp32BluetoothAdapter::releaseHidReports(connectivity::BluetoothPeerHandle handle) {
    const auto readiness = hidReadiness(handle);
    if (readiness != connectivity::BluetoothHidAdapterResult::Ready) {
        return readiness;
    }
    const auto keyboardResult = sendHidReport(handle, connectivity::HidKeyboardReport::neutral());
    if (keyboardResult != connectivity::BluetoothHidAdapterResult::Sent) {
        return keyboardResult;
    }
    return sendHidReport(handle, connectivity::HidConsumerReport::neutral());
}

connectivity::BluetoothCompanionAdapterResult
Esp32BluetoothAdapter::companionReadiness(connectivity::BluetoothPeerHandle handle) {
    const auto* peer = findPeer(handle);
    if (currentOwner() != this || !context.stackOwned || !context.companionServiceRegistered ||
        peer == nullptr) {
        return connectivity::BluetoothCompanionAdapterResult::AdapterError;
    }
    ble_gap_conn_desc descriptor{};
    const auto findResult = ble_gap_conn_find(peer->connectionHandle, &descriptor);
    if (findResult == BLE_HS_ENOTCONN) {
        return connectivity::BluetoothCompanionAdapterResult::Disconnected;
    }
    if (findResult != 0) {
        return connectivity::BluetoothCompanionAdapterResult::AdapterError;
    }
    portENTER_CRITICAL(&context.mutex);
    const bool subscribed = context.companionSubscribed;
    portEXIT_CRITICAL(&context.mutex);
    return descriptor.sec_state.encrypted != 0 && descriptor.sec_state.authenticated != 0 &&
                   descriptor.sec_state.bonded != 0 && subscribed
               ? connectivity::BluetoothCompanionAdapterResult::Ready
               : connectivity::BluetoothCompanionAdapterResult::NotReady;
}

connectivity::BluetoothCompanionAdapterResult
Esp32BluetoothAdapter::sendCompanionChunk(connectivity::BluetoothPeerHandle handle,
                                          const std::uint8_t* data, std::size_t size) {
    const auto readiness = companionReadiness(handle);
    if (readiness != connectivity::BluetoothCompanionAdapterResult::Ready) {
        return readiness;
    }
    const auto* peer = findPeer(handle);
    if (peer == nullptr || data == nullptr || size == 0) {
        return connectivity::BluetoothCompanionAdapterResult::Disconnected;
    }
    const auto hidResult =
        sendHidPayload(peer->connectionHandle, context.companionNotifyHandle, data, size);
    switch (hidResult) {
    case connectivity::BluetoothHidAdapterResult::Sent:
        return connectivity::BluetoothCompanionAdapterResult::Sent;
    case connectivity::BluetoothHidAdapterResult::Busy:
        return connectivity::BluetoothCompanionAdapterResult::Busy;
    case connectivity::BluetoothHidAdapterResult::Disconnected:
        return connectivity::BluetoothCompanionAdapterResult::Disconnected;
    case connectivity::BluetoothHidAdapterResult::NotReady:
        return connectivity::BluetoothCompanionAdapterResult::NotReady;
    case connectivity::BluetoothHidAdapterResult::Ready:
        return connectivity::BluetoothCompanionAdapterResult::Ready;
    case connectivity::BluetoothHidAdapterResult::AdapterError:
        return connectivity::BluetoothCompanionAdapterResult::AdapterError;
    }
    return connectivity::BluetoothCompanionAdapterResult::AdapterError;
}

bool Esp32BluetoothAdapter::receiveCompanionChunk(connectivity::CompanionChunk& chunk) {
    portENTER_CRITICAL(&context.mutex);
    if (context.companionIncomingCount == 0) {
        portEXIT_CRITICAL(&context.mutex);
        return false;
    }
    chunk = context.companionIncoming[context.companionIncomingHead];
    context.companionIncomingHead =
        (context.companionIncomingHead + 1) % context.companionIncoming.size();
    --context.companionIncomingCount;
    portEXIT_CRITICAL(&context.mutex);
    return true;
}

bool Esp32BluetoothAdapter::takeCompanionIncomingOverflow() {
    portENTER_CRITICAL(&context.mutex);
    const bool overflow = context.companionIncomingOverflow;
    context.companionIncomingOverflow = false;
    if (overflow) {
        clearCompanionIncomingLocked();
    }
    portEXIT_CRITICAL(&context.mutex);
    return overflow;
}

} // namespace cardputer_hub::hardware
